{
  "main": {
    "name": "Dawit Hagos 👋",
    "occupation": "Passionate Software Engineer",
    "description": "Love to build products using Vue, React and Flutter....",
    "image": "profilepic.jpg",
    "bio": "Passionate and experienced developer with more than 4 years of professional software development experience. Built more than 7 web applications and 3 cross-platform mobile apps. Offering expertise in Vue, React, Flutter, and Spring Boot, coupled with a passion for crafting exceptional user experiences. Enthusiastic about joining a dynamic team and contributing to the success. Fluent in English and experience working with Startup and Enterprise companies. Certified Azure Cloud Administrator also over 2 years of experience working with AWS (Amazon Web Service) managing cloud deployment.",
    "contactmessage": "Love to hear from you. Please reach-out with one of the Socials. Thank You  🙂 ",
    "email": "Dawith305@gmail.com",
    "phone": "+251929258441",
    "address": {
      "street": "",
      "city": "Addis Ababa",
      "state": "Bole",
      "zip": ""
    },
    "website": "",
    "resumedownload": "https://drive.google.com/file/d/1LN0JmEUxO_fzHEHcRkBKfReQcf9gYXUh/view?usp=sharing",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/dawith305",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/_invincible_d/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/dawith305",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "My Programming Language Proficiency",
    "education": [
      {
        "school": "Ethiopian Institute of Technology Mekelle",
        "degree": "Bachelor's Degree, Computer Engineering",
        "graduated": "July 2019",
        "description": "Graduated with First Class Honours"
      }
    ],
    "work": [
      {
        "title": "Frontend Developer",
        "company": "Skiwo - (Salita.no / Manymore.com)",
        "location": "Oslo, Norway - Remote",
        "years": "Oct 2021 - Oct 2023",
        "description": [
          "Played a key role in launching a new Automated Translation service on the platform, expanding its reach to a broader user base and enhancing the experience of customers, providers and the overall business.",
          "Led the front-end side of development of the platform to a Software-as-a-Service (SAAS) model, enabling scalable and flexible deployment options for possible clients.",
          "Successfully whitelisted the code base, allowing customisation of the app UI to match clients themes, resulting in a personalised & branded user experience.",
          "Maintained and updated the shared component library, enhancing code reusability, consistency, and development efficiency across projects.",
          "Implemented various performance optimisations, resulting in improved platform performance, including enhancing code efficiency and leveraging solutions like Server-Sent Events (SSE) for real-time updates.",
          "Collaborated closely with backend engineers, QA team, and product owners, to ensure seamless integration, thorough testing, and successful delivery of frontend features and enhancements.",
          "Contributed to transition off the platform from Vue to React, leveraging expertise in both frameworks.",
          "Participated in code reviews and provided feedback to improve code quality."
        ]
      },
      {
        "title": "Software Developer",
        "company": "Excellerent Technology Solutions",
        "location": "Pittsburgh, Pennsylvania - Remote",
        "years": "Jun 2021 - Apr 2022",
        "description": [
          "Worked closely with QA Team to convert Large monolithic Web Apps with different client requirements to be WCAG 2.1 (Accessibility) AA standard compliance compatible.",
          "Migrated web apps structure, typography, and imagery to support RTL languages such as Hebrew and Arabic.",
          "Built consistent front-end features. Designed and updated layouts to meet usability and performance requirements.",
          "Worked on the backend on features related to website accessibility migration."
        ]
      },
      {
        "title": "Full-Stack Software Engineer",
        "company": "Medco Technology Solutions PLC",
        "years": "Jun 2019 - Jun 2021",
        "location": "Addis Ababa - Onsite",
        "description": [
          "Led a team of 3 software engineers through the entire development process of the cross-platform apps using Flutter that run on Android and IOS starting from design, development, and deployment of the apps.",
          "Configured, deployed, and monitored Highly Available web applications on AWS with services such as EC2, S3, Route53, and RDS.",
          "Introduced cross-platform development in the company and team from Native app development.",
          "Led the development and deployment of the COVID19 system where till to date it served more than >40,000 patients.",
          "Collaborated with project managers to select ambitiously, but realistic coding milestones on pre-release software project development.",
          "Worked on open-source products customization that fits requirements and uses case of local medical facilities and health centers.          "
        ]
      },
      {
        "title": "Ontonite Trading",
        "company": "Mobile Application Developer and System Admin and Integrator",
        "years": "Aug 2019 - Dec 2019",
        "location": "Addis Ababa - Onsite",
        "description": [
          "Developed high-quality, concise Android applications to go with the developed system.",
          "Originated and developed creative design concepts using that exceeded client expectations. Developed and implemented process flow improvement.",
          "Coordinated ongoing technical training and personal development classes for staff members.",
          "Consulted with network engineering staff to evaluate hardware and software requirements for new system development.",
          "Managed to maintain the company database with essential account and clinical information.",
          "Reviewed technical documentation to complete system maintenance and repair.",
          "Trained and mentored a number of new personnel hired to fulfill various roles."
        
        ]
      }
    ],
    "skills": [
      {
        "name": "Vue",
        "level": "90%"
      },
      {
        "name": "React",
        "level": "85%"
      },
      {
        "name": "Flutter",
        "level": "75%"
      },
      {
        "name": "Spring Boot",
        "level": "75%"
      },
      {
        "name": "AWS",
        "level": "60%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Translation (React)",
        "category": "Web App",
        "image": "Salita-booking.png",
        "url": "https://www.salita.no"
      },
      {
        "title": "My Salita (Vue)",
        "category": "Web App",
        "image": "Salita-my-salita.png",
        "url": "https://my.salita.no/en/no/auth/sign_in"
      },
      {
        "title": "Covid19-LIS-App (Vue.js)",
        "category": "Web App",
        "image": "Boston-Landing.png",
        "url": "https://bostonadvancedlab.com"
      },
      {
        "title": "eRxEthiopia (Flutter)",
        "category": "Cross Platform Mobile App",
        "image": "erx-login.jpeg",
        "url": "https://play.google.com/store/apps/details?id=medcoanalyticts.com.erxethiopia.mobile"
      },
      {
        "title": "Connect (React)",
        "category": "Web App (SaaS)",
        "image": "Salita-connect.png",
        "url": "https://manage.salita.no"
      },
      {
        "title": "Jabulani ERP (Vue.js)",
        "category": "Single Page App",
        "image": "ja-rooms.png",
        "url": "http://ec2-54-235-100-119.compute-1.amazonaws.com/"
      },
      {
        "title": "Youth-ME (Flutter)",
        "category": "Cross Platform Mobile App",
        "image": "you-requested.jpeg",
        "url": "https://play.google.com/store/apps/details?id=com.medcoanalytics.youth_and_adolesence"
      },
      {
        "title": "Spot-Rooms (Next.js)",
        "category": "Web App with SSR",
        "image": "spot-date.png",
        "url": "https://spot-rooms.vercel.app"
      },
      {
        "title": "Facebook UI (Flutter)",
        "category": "Cross Platform Mobile App",
        "image": "fb-UI.png",
        "url": "https://play.google.com/store/apps/details?id=com.medcoanalytics.youth_and_adolesence"
      },
      {
        "title": "We-Talk(React.js)",
        "category": "Single Page App",
        "image": "we-talk-chat.png",
        "url": "https://we-talk-ceb5e.web.app/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Dawit is an outstanding developer, his attention to detail, taking products to another level, being a leader in his team brainstorming and collaborating with team members. He is very humble and technically Very Good. I would definitely recommend him.",
        "user": "Habtamu Desalegn"
      }
    ]
  }
}
